number : 0

5 4  1


step 1: take remainder by 10: 
step 2: number divided by 10

### maximum number from a list

check if current number is greater than max value. if yes, replace max

                                                                max

[     10             1             5             3         6     11   ]

In [35]:
#ask  how many items user wants to insert into the list
number = int(input("Enter number of items to be added: "))

#create a blank list
values = []

#run loop upto "number" times
for count in range(number):
    #take an item from user
    item = int(input("Enter a new item to be added: "))
    #append to the list
    values.append(        item       )

#this is my list
print(values)

#set max to first item
max_number = values[0]

for item in values:
    if item > max_number:
        max_number = item

print(f"The max value in the list is: {max_number}")

[19, 21, 10, 9, 7]
The max value in the list is: 21

### reverse a number using concept of quotient- remainder

In [ ]:
number = int(input("Enter a number: "))

print(f"Original number: {number}")
print("Reversed number", end="")


while number > 0 :
    remainder = number % 10 #last digit of the number
    print(int(remainder), end="")
    number = number // 10 #remaining digits from the number

Original number: 145
Reversed number541

In [ ]:
number = int(input("Enter a number: "))
print( str(number)[    : : -1       ] )

321001

In [ ]:
name = "harshit"
#    0       1          2             3            4         5      6
#    h       a          r             s            h         i      t
print( name[   0  : 5 : 1    ] ) #start reading at 0, go to all positions less than 5, add 1 each time

harsh

In [ ]:
print(name [      2 : 6  : 1    ])

rshi

5 * 4 * 3 * 2 * 1


for any number "N" , multiply all number between 1 to N

In [ ]:
number = int(input("Enter a number: "))

result = 1
             #   start  end     step
for count in range(1, number+1,  1):
    result = result * count


print(f"Factorial of {number} is: {result}")

Factorial of 5 is: 120

## fibonacci series

    a    b
0   1   1    2      3           5

In [ ]:
N = int(input("Enter value of N: "))

first_number = 0
second_number = 1

print("0 1", end=" ")

for count in range(N-2):
    ans = first_number + second_number
    print(ans, end=" ")
    first_number = second_number
    second_number = ans

0 1 1 2 3 5 8 13 21 34

In [20]:
import pandas as pd
import plotly.express as pe

#shape
#column names
#current index
#check missing values in dataset per column
#check unique value per column in the data
#info of the table
#### separate real v/s categorical data
#print statistical descriptions of data

In [21]:
path = r"/home/harshit/Desktop/PythonDA/datasets/Loan_Status_Classification.csv"

df = pd.read_csv(path)

df

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,1,1,0,0,6608,0,137,180,1,1,1
1,0,1,2,0,0,4226,1040,110,360,1,1,1
2,1,1,0,1,0,3167,2283,154,360,1,2,1
3,0,0,0,1,1,6950,0,175,180,1,2,1
4,0,1,0,1,0,3993,3274,207,360,1,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...
293,1,0,0,1,0,3846,0,111,360,1,2,1
294,0,0,0,1,0,2435,0,75,360,1,1,0
295,0,0,2,1,0,4923,0,166,360,0,2,1
296,0,1,3,0,0,2071,754,94,480,1,2,1
297,1,0,0,1,0,2378,0,46,360,1,3,0

In [22]:
df.shape

(298, 12)

In [23]:
df.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=298, step=1)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 298 entries, 0 to 297
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             298 non-null    int64
 1   Married            298 non-null    int64
 2   Dependents         298 non-null    int64
 3   Education          298 non-null    int64
 4   Self_Employed      298 non-null    int64
 5   ApplicantIncome    298 non-null    int64
 6   CoapplicantIncome  298 non-null    int64
 7   LoanAmount         298 non-null    int64
 8   Loan_Amount_Term   298 non-null    int64
 9   Credit_History     298 non-null    int64
 10  Property_Area      298 non-null    int64
 11  Loan_Status        298 non-null    int64
dtypes: int64(12)
memory usage: 28.1 KB

In [26]:
df.nunique()

Gender                 2
Married                2
Dependents             4
Education              2
Self_Employed          2
ApplicantIncome      257
CoapplicantIncome    150
LoanAmount           145
Loan_Amount_Term       9
Credit_History         2
Property_Area          3
Loan_Status            2
dtype: int64

In [27]:
df.isna().sum()

Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [33]:
real_value_columns = ["ApplicantIncome", "CoapplicantIncome", "LoanAmount"]

categorical_columns = [     col for col in df.columns if col not in real_value_columns   ]

df[categorical_columns] = df[categorical_columns].astype("object")

In [34]:
df[categorical_columns].describe()

,Gender,Married,Dependents,Education,Self_Employed,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,298,298,298,298,298,298,298,298,298
unique,2,2,4,2,2,9,2,3,2
top,0,1,0,1,0,360,1,2,1
freq,245,187,176,235,258,248,231,115,150

In [32]:
df[real_value_columns].describe()

       ApplicantIncome  CoapplicantIncome  LoanAmount
count       298.000000         298.000000  298.000000
mean       5351.265101        1673.026846  143.560403
std        6306.080712        2892.404818   80.395182
min         150.000000           0.000000    9.000000
25%        2883.750000           0.000000   99.250000
50%        3854.000000        1106.000000  125.500000
75%        5721.500000        2281.000000  171.500000
max       81000.000000       33837.000000  600.000000